// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12
// Ограничения:
// - Должна быть отдельная функция, которая возвразает результат суммы цифр
// - Внутри функций НЕЛЬЗЯ использовать класс Console. Только в основном блоке кода

int SumDigits(int number)
{
    int result = 0;
    while (number > 0)
    {
        result += number % 10;
        number /= 10;
    }
    return result;
}

Console.Clear();

Console.Write("Введите число: ");
int number = Math.Abs(int.Parse(Console.ReadLine()!));

Console.WriteLine($"Сумма цифр в числе {number} равна {SumDigits(number)}");
